# BadViewDirectionSetting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..BadViewDirectionSetting Property
BuiltInFailures..::..ViewFailures Class See Also
---
Plan view DBViewType has invalid view direction parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadViewDirectionSetting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadViewDirectionSetting As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadViewDirectionSetting {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace